#include "Common.h"

/* -------------------------------------------------- */
// プライベート関数
/* -------------------------------------------------- */

uint8_t itochar(uint8_t value);

/* -------------------------------------------------- */

// ---------------------------------------------
// 文字リテラル
// =--------------------------------------------

uint8_t STR_CHAR_BLANK  = ' ';
uint8_t *STR_LINE_BLANK = "        ";

/* -------------------------------------------------- */

// 数値一文字をchar型へ変換

uint8_t itochar(uint8_t value) {
    if (value > DECIMAL_MAX) {
        return STR_CHAR_BLANK;
    }
    return "0123456789"[value];
}
